artillery/basic-test.yml
config:
  target: 'http://4.236.218.246/'  # The base URL of the application
  phases:
    - name: '1000 users'
      duration: 100  # Test duration in seconds
      arrivalRate: 1000  # Number of new virtual users arriving per second
    - name: '5000 users'
      duration: 100  # Test duration in seconds
      arrivalRate: 5000  # Number of new virtual users arriving per second
scenarios:
  - flow:
    - get:
        url: '/'  # Relative URL to the target