artillery/basic-test.yml
config:
  target: 'http://108.142.77.15:8080/'  # The base URL of the application
  phases:
    - name: '1000 users'
      duration: 100  # Test duration in seconds
      arrivalRate: 1000  # Number of new virtual users arriving per second
    - name: '5000 users'
      duration: 100  # Test duration in seconds
      arrivalRate: 5000  # Number of new virtual users arriving per second
scenarios:
  - flow:
      - post:
          url: '/items'
          json:
            name: 'faccetta nera'